[M_Sage_Mission02_CUT MissionDefinition]
MissionName="Reacondicionamento"
MissionDescription="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia.\nNão obstante, antes de fazer isso seria interessante recolher uma melhoria líquida... pode ser que seja útil mais tarde."
TurnInDescription="Que se faça a luz! E o ar condicionado... e as instalações sanitárias também!"
MissionSummary="Pegue uma melhoria líquida."
MissionGiver="Sir Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText=""

[M_Sage_Mission02_CUT:ActivateGenerator MissionObjectiveDefinition]
ProgressMessage=""

[M_Sage_Mission02_CUT:ActivateGeneratorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:ClearDebris1 MissionObjectiveDefinition]
ProgressMessage="Remova os escombros do acionador Sul"

[M_Sage_Mission02_CUT:ClearDebris2 MissionObjectiveDefinition]
ProgressMessage="Remova os escombros do acionador Leste"

[M_Sage_Mission02_CUT:ClearDebris3 MissionObjectiveDefinition]
ProgressMessage="Remova os escombros do acionador Norte"

[M_Sage_Mission02_CUT:ClearDebrisSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Desbloqueie os pistões dos geradores para que a energia possa chegar até o chalé de Sir Hammerlock."
MissionDescriptionOverride="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia.\nVocê acionou um comutador que parecia ser muito importante porém, parece que não aconteceu nada. O profesor Nakayama disse que tinha bloqueado os pistõess do gerador para poder desviar toda eletricidade para um projeto secreto que ele mantém.\nÉ preciso desbloquear os pistões para restaurar o fluxo de energia até o chalé do Hammerlock novamente."

[M_Sage_Mission02_CUT:DivertPowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:EnableCoolingFan MissionObjectiveDefinition]
ProgressMessage="Ative o ventilador"

[M_Sage_Mission02_CUT:EnableCoolingFanSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Ligue o ventilador."
MissionDescriptionOverride="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia.\nVocê ativou a energia e desbloqueou os pistões do gerador porém, o ambiente está muito quente. Hammerlock precisa que você ligue o ventilador para que vocês não se convertam em petiscos assados com sabor de Caçador da Sepultura."

[M_Sage_Mission02_CUT:EnableCoolingFanSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Ligue o ventilador."
MissionDescriptionOverride="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia.\nVocê ativou a energia e desbloqueou os pistões do gerador porém, o ambiente está muito quente. Hammerlock precisa que você ligue o ventilador para que vocês não se convertam em petiscos assados com sabor de Caçador da Sepultura."

[M_Sage_Mission02_CUT:EnablePower MissionObjectiveDefinition]
ProgressMessage="Conecte a corrente de energia"

[M_Sage_Mission02_CUT:EnablePowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:FinalSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:FindGenerator MissionObjectiveDefinition]
ProgressMessage="Encontre o gerador de eletricidade"

[M_Sage_Mission02_CUT:FindGeneratorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:GetBuffDrink MissionObjectiveDefinition]
ProgressMessage="Pegue uma melhoria líquida"

[M_Sage_Mission02_CUT:GotoPowerStation MissionObjectiveDefinition]
ProgressMessage="Encontre a antiga central elétrica"

[M_Sage_Mission02_CUT:GotoPowerStationSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Vá até a Estação Ardorton e restaure a eletricidade do chalé do Hammerlock."
MissionDescriptionOverride="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia."

[M_Sage_Mission02_CUT:GrabBuffDrinkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:KillCreature MissionObjectiveDefinition]
ProgressMessage="Elimine a criatura"

[M_Sage_Mission02_CUT:KillCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:KillEndBoss MissionObjectiveDefinition]
ProgressMessage="Elimine a criatura"

[M_Sage_Mission02_CUT:KillEndBossSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Elimine a criatura que se colocou entre você e o ventilador."
MissionDescriptionOverride="Você chegou ao chalé de caça de Sir Hammerlock porém, está tudo apagado. Hammerlock pediu que você vá até uma central elétrica próxima e reative a energia.\nVocê ativou a energia e desbloqueou os pistões do gerador porém, o ambiente está muito quente. Hammerlock precisa que você ligue o ventilador para que vocês não se convertam em petiscos assados com sabor de Caçador da Sepultura.\nQuando estava à caminho do ventilador, uma gigantesca criatura se colocou no caminho. É preciso eliminar essa criatura se quiser passar."

[M_Sage_Mission02_CUT:Node1Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node2 MissionObjectiveDefinition]
ProgressMessage="Desvie a corrente no segundo nó"

[M_Sage_Mission02_CUT:Node2Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node3 MissionObjectiveDefinition]
ProgressMessage="Desvie a corrente no terceiro nó"

[M_Sage_Mission02_CUT:Node3Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node4 MissionObjectiveDefinition]
ProgressMessage="Desvie a corrente no quarto nó"

[M_Sage_Mission02_CUT:PowerLodge MissionObjectiveDefinition]
ProgressMessage="Acenda as luzes"

[M_Sage_Mission02_CUT:PowerLodgeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:RepairSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:ReturnHammerlock MissionObjectiveDefinition]
ProgressMessage="Volte até sir Hammerlock"

[M_Sage_Mission02_CUT:ReturnHammerlockSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Volte ao chalé do Hammerlock e ative a corrente de energia."
MissionDescriptionOverride="Você perambulou pela Estação Ardorton e conseguiu desviar uma grande quantidade de eletricidade para o chalé de caça de Sir Hammerlock. Agora você só precisa voltar até lá e ativar a corrente de energia."

